In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj = Series([4,7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3])

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj = Series([4,7,-5,3], index=['d', 'b', 'a', 'c'])

In [7]:
obj

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj[obj > 0]

d    4
b    7
c    3
dtype: int64

In [10]:
'b' in obj

True

In [11]:
sdata = {'Ohio': 3500, 'Texas': 7100, 'Oregon': 16000}
obj3 = Series(sdata)

In [12]:
obj3

Ohio       3500
Oregon    16000
Texas      7100
dtype: int64

In [13]:
states = ['California', 'Ohio', 'Oregon']
obj4 = Series(sdata, index=states)

In [14]:
obj4

California        NaN
Ohio           3500.0
Oregon        16000.0
dtype: float64

In [15]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
dtype: bool

In [16]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
dtype: bool

In [17]:
obj4.name = 'population'

In [19]:
obj4.index.name = 'state'

In [20]:
obj4

state
California        NaN
Ohio           3500.0
Oregon        16000.0
Name: population, dtype: float64

In [23]:
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9]
       }

frame = DataFrame(data)

In [25]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [35]:
frame2= DataFrame(data, columns=['year', 'pop'])

In [36]:
frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

In [37]:
frame.append(frame2)

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
0  1.5     NaN  2000
1  1.7     NaN  2001
2  3.6     NaN  2002
3  2.4     NaN  2001
4  2.9     NaN  2002

In [44]:
obj = Series(np.random.rand(4), index=['a', 'b', 'c', 'd'])

In [45]:
obj

a    0.642649
b    0.178976
c    0.797630
d    0.815126
dtype: float64

In [46]:
obj[[0]]

a    0.642649
dtype: float64

In [47]:
obj[[1,3]]

b    0.178976
d    0.815126
dtype: float64

In [48]:
obj[:2]

a    0.642649
b    0.178976
dtype: float64

In [49]:
obj[obj > 3]

Series([], dtype: float64)

In [54]:
obj

a    0.642649
b    0.178976
c    0.797630
d    0.815126
dtype: float64

In [55]:
frame = DataFrame(np.random.randn(4,3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [56]:
frame

               b         d         e
Utah   -0.922917 -0.110673  0.615105
Ohio   -1.135229  0.782711 -0.322446
Texas  -0.311474  3.263301  1.924847
Oregon -1.422551  1.125040  0.506082

In [61]:
f = lambda x: x.max() - x.min()
frame.apply(f, axis=1)

Utah      1.538022
Ohio      1.917940
Texas     3.574775
Oregon    2.547591
dtype: float64

In [94]:
frame['e'].isin([0.615105])

Utah      False
Ohio      False
Texas     False
Oregon    False
Name: e, dtype: bool

In [97]:
frame.notnull()

           b     d     e
Utah    True  True  True
Ohio    True  True  True
Texas   True  True  True
Oregon  True  True  True